Revit 2027 API
SpatialElementTag.IsOrphaned Property
 Identifies if the tag is orphaned or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsOrphaned { get; }
Public ReadOnly Property IsOrphaned As Boolean
	Get
public:
property bool IsOrphaned {
	bool get ();
}
member IsOrphaned : bool with get
Property Value
Boolean
Remarks
 The orphan tags are used to tag a spatial element in a link document, but the spatial element was deleted.
See Also
Reference
SpatialElementTag Class
Autodesk.Revit.DB Namespace